iNavFlight/inav/lib/main/ChibiOS/community/os/hal/ports/TIVA/TM4C129x/tm4c129x.h
/**
 * @brief Universal Asynchronous Receiver/Transmitter
 */
typedef struct
{
  __IO uint32_t DR;             /**< Data                                    */
  union  {
    __I  uint32_t RSR;          /**< Receive Status                          */
    __O  uint32_t ECR;          /**< Error Clear                             */
  };
  __I  uint32_t _RESERVED0[4];  /**< Reserved                                */
  __I  uint32_t FR;             /**< Flag                                    */
  __I  uint32_t _RESERVED1[1];  /**< Reserved                                */
  __IO uint32_t ILPR;           /**< IrDA Low-Power Register                 */
  __IO uint32_t IBRD;           /**< Integer Baud-Rate Divisor               */
  __IO uint32_t FBRD;           /**< Fractional Baud-Rate Divisor            */
  __IO uint32_t LCRH;           /**< Line Control                            */
  __IO uint32_t CTL;            /**< Control                                 */
  __IO uint32_t IFLS;           /**< Interrupt FIFO Level Select             */
  __IO uint32_t IM;             /**< Interrupt Mask                          */
  __I  uint32_t RIS;            /**< Raw Interrupt Status                    */
  __I  uint32_t MIS;            /**< Masked Interrupt Status                 */
  __O uint32_t ICR;             /**< Interrupt Clear                         */
  __IO uint32_t DMACTL;         /**< DMA Control                             */
  __I  uint32_t _RESERVED2[22]; /**< Reserved                                */
  __IO uint32_t BIT9ADDR;       /**< 9-Bit Self Address                      */
  __IO uint32_t BIT9AMASK;      /**< 9-Bit Self Address Mask                 */
  __I  uint32_t _RESERVED3[965];/**< Reserved                                */
  __I  uint32_t PP;             /**< Peripheral Properties                   */
  __I  uint32_t _RESERVED4[1];  /**< Reserved                                */
  __IO uint32_t CC;             /**< Clock Configuration                     */
} UART_TypeDef;

/**
 * @brief Micro Direct Memory Access
 */
typedef struct
{
  __IO uint32_t SET;            /**< Set                                     */
  __O  uint32_t CLR;            /**< Clear                                   */
} UDMA_SC_t;

typedef struct
{
  __IO uint32_t STAT;           /**< Status                                  */
  __O  uint32_t CFG;            /**< Configuration                           */
  __IO uint32_t CTLBASE;        /**< Channel Control Base Pointer            */
  __IO uint32_t ALTBASE;        /**< Alternate Channel Control Base Pointer  */
  __IO uint32_t WAITSTAT;       /**< Channel Wait-on-Request Status          */
  __O  uint32_t SWREQ;          /**< Channel Software Request                */
  UDMA_SC_t USEBURST;           /**< Channel Useburst registers              */
  UDMA_SC_t REQMASK;            /**< Channel Request Mask registers          */
  UDMA_SC_t ENA;                /**< Channel Enable registers                */
  UDMA_SC_t ALT;                /**< Channel Primary Alternate registers     */
  UDMA_SC_t PRIO;               /**< Channel Priority registers              */
  __I  uint32_t _RESERVED0[3];  /**< Reserved                                */
  __IO uint32_t ERRCLR;         /**< Bus Error Clear                         */
  __I  uint32_t _RESERVED1[300];/**< Reserved                                */
  __IO uint32_t CHASGN;         /**< Channel Assignment                      */
  __IO uint32_t CHIS;           /**< Channel Interrupt Status                */
  __I  uint32_t _RESERVED2[2];  /**< Reserved                                */
  __IO uint32_t CHMAP[4];       /**< Channel Map Select 0, 1, 2 and 3        */
} UDMA_TypeDef;

// USB

/**
 * @brief Watchdog Timer
 */
typedef struct
{
  __IO uint32_t LOAD;           /**< Load                                    */
  __I  uint32_t VALUE;          /**< Value                                   */
  __IO uint32_t CTL;            /**< Control                                 */
  __O  uint32_t ICR;            /**< Interrupt Clear                         */
  __I  uint32_t RIS;            /**< Raw Interrupt Status                    */
  __I  uint32_t MIS;            /**< Masked Interrupt Status                 */
  __I  uint32_t _RESERVED0[256];/**< Reserved                                */
  __IO uint32_t TEST;           /**< Test                                    */
  __I  uint32_t _RESERVED1[505];/**< Reserved                                */
  __IO uint32_t LOCK;           /**< Lock                                    */
} WDG_TypeDef;

/**
 * @brief   Ethernet peripheral
 */
typedef struct {
  __IO uint32_t CFG;            /**< Configuration                           */
  __IO uint32_t FRAMEFLTR;      /**< Frame Filter                            */
  __IO uint32_t HASHTBLH;       /**< Hash Table High                         */
  __IO uint32_t HASHTBLL;       /**< Hash Table Low                          */
  __IO uint32_t MIIADDR;        /**< MII Address                             */
  __IO uint32_t MIIDATA;        /**< MII Data Register                       */
  __IO uint32_t FLOWCTL;        /**< Flow Control                            */
  __IO uint32_t VLANTG;         /**< VLAN Tag                                */
  __I  uint32_t RESERVED0[1];   /**< Reserved                                */
  __IO uint32_t STATUS;         /**< Status                                  */
  __IO uint32_t RWUFF;          /**< Remote Wake-Up Frame Filter             */
  __IO uint32_t PMTCTLSTAT;     /**< PMT Control and Status Register         */
  __I  uint32_t RESERVED1[2];   /**< Reserved                                */
  __IO uint32_t RIS;            /**< Raw Interrupt Status                    */
  __IO uint32_t IM;             /**< Interrupt Mask                          */
  __IO uint32_t ADDR0H;         /**< Address 0 High                          */
  __IO uint32_t ADDR0L;         /**< Address 0 Low Register                  */
  __IO uint32_t ADDR1H;         /**< Address 1 High                          */
  __IO uint32_t ADDR1L;         /**< Address 1 Low                           */
  __IO uint32_t ADDR2H;         /**< Address 2 High                          */
  __IO uint32_t ADDR2L;         /**< Address 2 Low                           */
  __IO uint32_t ADDR3H;         /**< Address 3 High                          */
  __IO uint32_t ADDR3L;         /**< Address 3 Low                           */
  __I  uint32_t RESERVED2[31];  /**< Reserved                                */
  __IO uint32_t WDOGTO;         /**< Watchdog Timeout                        */
  __I  uint32_t RESERVED3[8];   /**< Reserved                                */
  __IO uint32_t MMCCTRL;        /**< MMC Control                             */
  __IO uint32_t MMCRXRIS;       /**< MMC Receive Raw Interrupt Status        */
  __IO uint32_t MMCTXRIS;       /**< MMC Transmit Raw Interrupt Status       */
  __IO uint32_t MMCRXIM;        /**< MMC Receive Interrupt Mask              */
  __IO uint32_t MMCTXIM;        /**< MMC Transmit Interrupt Mask             */
  __I  uint32_t RESERVED4[1];   /**< Reserved                                */
  __IO uint32_t TXCNTGB;        /**< Transmit Frame Count for Good and Bad
                                     Frames                                  */
  __I  uint32_t RESERVED5[12];  /**< Reserved                                */
  __IO uint32_t TXCNTSCOL;      /**< Transmit Frame Count for Frames
                                     Transmitted after Single Collision      */
  __IO uint32_t TXCNTMCOL;      /**< Transmit Frame Count for Frames
                                     Transmitted after Multiple Collisions   */
  __I  uint32_t RESERVED6[4];   /**< Reserved                                */
  __IO uint32_t TXOCTCNTG;      /**< Transmit Octet Count Good               */
  __I  uint32_t RESERVED7[6];   /**< Reserved                                */
  __IO uint32_t RXCNTGB;        /**< Receive Frame Count for Good and Bad
                                     Frames                                  */
  __I  uint32_t RESERVED8[4];   /**< Reserved                                */
  __IO uint32_t RXCNTCRCERR;    /**< Receive Frame Count for CRC Error Frames*/
  __IO uint32_t RXCNTALGNERR;   /**< Receive Frame Count for Alignment Error
                                     Frames                                  */
  __I  uint32_t RESERVED9[10];  /**< Reserved                                */
  __IO uint32_t RXCNTGUNI;      /**< Receive Frame Count for Good Unicast
                                     Frames                                  */
  __I  uint32_t RESERVED10[239];/**< Reserved                                */
  __IO uint32_t VLNINCREP;      /**< VLAN Tag Inclusion or Replacement       */
  __IO uint32_t VLANHASH;       /**< VLAN Hash Table                         */
  __I  uint32_t RESERVED11[93]; /**< Reserved                                */
  __IO uint32_t TIMSTCTRL;      /**< Timestamp Control                       */
  __IO uint32_t SUBSECINC;      /**< Sub-Second Increment                    */
  __IO uint32_t TIMSEC;         /**< System Time - Seconds                   */
  __IO uint32_t TIMNANO;        /**< System Time - Nanoseconds               */
  __IO uint32_t TIMSECU;        /**< System Time - Seconds Update            */
  __IO uint32_t TIMNANOU;       /**< System Time - Nanoseconds Update        */
  __IO uint32_t TIMADD;         /**< Timestamp Addend                        */
  __IO uint32_t TARGSEC;        /**< Target Time Seconds                     */
  __IO uint32_t TARGNANO;       /**< Target Time Nanoseconds                 */
  __IO uint32_t HWORDSEC;       /**< System Time-Higher Word Seconds         */
  __IO uint32_t TIMSTAT;        /**< Timestamp Status                        */
  __IO uint32_t PPSCTRL;        /**< PPS Control                             */
  __I  uint32_t RESERVED12[12]; /**< Reserved                                */
  __IO uint32_t PPS0INTVL;      /**< PPS0 Interval                           */
  __IO uint32_t PPS0WIDTH;      /**< PPS0 Width                              */
  __I  uint32_t RESERVED13[294];/**< Reserved                                */
  __IO uint32_t DMABUSMOD;      /**< DMA Bus Mode                            */
  __O  uint32_t TXPOLLD;        /**< Transmit Poll Demand                    */
  __O  uint32_t RXPOLLD;        /**< Receive Poll Demand                     */
  __IO uint32_t RXDLADDR;       /**< Receive Descriptor List Address         */
  __IO uint32_t TXDLADDR;       /**< Transmit Descriptor List Address        */
  __IO uint32_t DMARIS;         /**< DMA Interrupt Status                    */
  __IO uint32_t DMAOPMODE;      /**< DMA Operation Mode                      */
  __IO uint32_t DMAIM;          /**< DMA Interrupt Mask Register             */
  __IO uint32_t MFBOC;          /**< Missed Frame and Buffer Overflow Counter*/
  __IO uint32_t RXINTWDT;       /**< Receive Interrupt Watchdog Timer        */
  __I  uint32_t RESERVED14[8];  /**< Reserved                                */
  __IO uint32_t HOSTXDESC;      /**< Current Host Transmit Descriptor        */
  __IO uint32_t HOSRXDESC;      /**< Current Host Receive Descriptor         */
  __IO uint32_t HOSTXBA;        /**< Current Host Transmit Buffer Address    */
  __IO uint32_t HOSRXBA;        /**< Current Host Receive Buffer Address     */
  __I  uint32_t RESERVED15[218];/**< Reserved                                */
  __IO uint32_t PP;             /**< Peripheral Property Register            */
  __IO uint32_t PC;             /**< Peripheral Configuration Register       */
  __IO uint32_t CC;             /**< Clock Configuration Register            */
  __I  uint32_t RESERVED16[1];  /**< Reserved                                */
  __I  uint32_t PHYRIS;         /**< PHY Raw Interrupt Status                */
  __IO uint32_t PHYIM;          /**< PHY Interrupt Mask                      */
  __IO uint32_t PHYMISC;        /**< PHY Masked Interrupt Status and Clear   */
} ETH_TypeDef;

/**
 * @}
 */

/**
 * @addtogroup Peripheral_memorymap
 * @{
 */

#define SYSCTL_BASE 0x400FE000
#define HIB_BASE    0x400FC000
#define FLASH_BASE  0x400FD000
#define EEPROM_BASE 0x400AF000
#define UDMA_BASE   0x400FF000
#define GPIOA_BASE  0x40058000
#define GPIOB_BASE  0x40059000
#define GPIOC_BASE  0x4005A000
#define GPIOD_BASE  0x4005B000
#define GPIOE_BASE  0x4005C000
#define GPIOF_BASE  0x4005D000
#define GPIOG_BASE  0x4005E000
#define GPIOH_BASE  0x4005F000
#define GPIOJ_BASE  0x40060000
#define GPIOK_BASE  0x40061000
#define GPIOL_BASE  0x40062000
#define GPIOM_BASE  0x40063000
#define GPION_BASE  0x40064000
#define GPIOP_BASE  0x40065000
#define GPIOQ_BASE  0x40066000
#define GPIOR_BASE  0x40067000
#define GPIOS_BASE  0x40068000
#define GPIOT_BASE  0x40069000
#define GPT0_BASE   0x40030000
#define GPT1_BASE   0x40031000
#define GPT2_BASE   0x40032000
#define GPT3_BASE   0x40033000
#define GPT4_BASE   0x40034000
#define GPT5_BASE   0x40035000
#define GPT6_BASE   0x400E0000
#define GPT7_BASE   0x400E1000
#define WDT0_BASE   0x40000000
#define WDT1_BASE   0x40001000
#define ADC0_BASE   0x40038000
#define ADC1_BASE   0x40039000
#define UART0_BASE  0x4000C000
#define UART1_BASE  0x4000D000
#define UART2_BASE  0x4000E000
#define UART3_BASE  0x4000F000
#define UART4_BASE  0x40010000
#define UART5_BASE  0x40011000
#define UART6_BASE  0x40012000
#define UART7_BASE  0x40013000
#define SSI0_BASE   0x40008000
#define SSI1_BASE   0x40009000
#define SSI2_BASE   0x4000A000
#define SSI3_BASE   0x4000B000
#define I2C0_BASE   0x40020000
#define I2C1_BASE   0x40021000
#define I2C2_BASE   0x40022000
#define I2C3_BASE   0x40023000
#define I2C4_BASE   0x400C0000
#define I2C5_BASE   0x400C1000
#define I2C6_BASE   0x400C2000
#define I2C7_BASE   0x400C3000
#define I2C8_BASE   0x400B8000
#define I2C9_BASE   0x400B9000
#define CAN0_BASE   0x40040000
#define CAN1_BASE   0x40041000
// usb
#define ACMP_BASE   0x4003C000
#define PWM0_BASE   0x40028000
#define QEI0_BASE   0x4002C000
#define QEI1_BASE   0x4002D000

