iNavFlight/inav/lib/main/ChibiOS/community/os/hal/ports/TIVA/TM4C129x/tm4c129x.h
#define ETH_BASE    0x400EC000

/**
 * @}
 */

/** 
 * @addtogroup Peripheral_declaration
 * @{
 */

#define SYSCTL  ((SYSCTL_TypeDef *) SYSCTL_BASE)
#define HIB     ((HIB_TypeDef *)    HIB_BASE)
#define FLASH   ((FLASH_TypeDef *)  FLASH_BASE)
#define EEPROM  ((EEPROM_TypeDef *) EEPROM_BASE)
#define UDMA    ((UDMA_TypeDef *)   UDMA_BASE)										
#define GPIOA   ((GPIO_TypeDef *)   GPIOA_BASE)
#define GPIOB   ((GPIO_TypeDef *)   GPIOB_BASE)
#define GPIOC   ((GPIO_TypeDef *)   GPIOC_BASE)
#define GPIOD   ((GPIO_TypeDef *)   GPIOD_BASE)
#define GPIOE   ((GPIO_TypeDef *)   GPIOE_BASE)
#define GPIOF   ((GPIO_TypeDef *)   GPIOF_BASE)
#define GPIOG   ((GPIO_TypeDef *)   GPIOG_BASE)
#define GPIOH   ((GPIO_TypeDef *)   GPIOH_BASE)
#define GPIOJ   ((GPIO_TypeDef *)   GPIOJ_BASE)
#define GPIOK   ((GPIO_TypeDef *)   GPIOK_BASE)
#define GPIOL   ((GPIO_TypeDef *)   GPIOL_BASE)
#define GPIOM   ((GPIO_TypeDef *)   GPIOM_BASE)
#define GPION   ((GPIO_TypeDef *)   GPION_BASE)
#define GPIOP   ((GPIO_TypeDef *)   GPIOP_BASE)
#define GPIOQ   ((GPIO_TypeDef *)   GPIOQ_BASE)
#define GPIOR   ((GPIO_TypeDef *)   GPIOR_BASE)
#define GPIOS   ((GPIO_TypeDef *)   GPIOS_BASE)
#define GPIOT   ((GPIO_TypeDef *)   GPIOT_BASE)
#define GPT0    ((GPT_TypeDef *)    GPT0_BASE)
#define GPT1    ((GPT_TypeDef *)    GPT1_BASE)
#define GPT2    ((GPT_TypeDef *)    GPT2_BASE)
#define GPT3    ((GPT_TypeDef *)    GPT3_BASE)
#define GPT4    ((GPT_TypeDef *)    GPT4_BASE)
#define GPT5    ((GPT_TypeDef *)    GPT5_BASE)
#define GPT6    ((GPT_TypeDef *)    GPT6_BASE)
#define GPT7    ((GPT_TypeDef *)    GPT7_BASE)
#define WDT0    ((WDT_TypeDef *)    WDT0_BASE)
#define WDT1    ((WDT_TypeDef *)    WDT1_BASE)
#define ADC0    ((ADC_TypeDef*)     ADC0_BASE)
#define ADC1    ((ADC_TypeDef*)     ADC1_BASE)
#define UART0   ((UART_TypeDef *)   UART0_BASE)
#define UART1   ((UART_TypeDef *)   UART1_BASE)
#define UART2   ((UART_TypeDef *)   UART2_BASE)
#define UART3   ((UART_TypeDef *)   UART3_BASE)
#define UART4   ((UART_TypeDef *)   UART4_BASE)
#define UART5   ((UART_TypeDef *)   UART5_BASE)
#define UART6   ((UART_TypeDef *)   UART6_BASE)
#define UART7   ((UART_TypeDef *)   UART7_BASE)
#define SSI0    ((SSI_TypeDef *)    SSI0_BASE)
#define SSI1    ((SSI_TypeDef *)    SSI1_BASE)
#define SSI2    ((SSI_TypeDef *)    SSI2_BASE)
#define SSI3    ((SSI_TypeDef *)    SSI3_BASE)
#define I2C0    ((I2C_TypeDef *)    I2C0_BASE)
#define I2C1    ((I2C_TypeDef *)    I2C1_BASE)
#define I2C2    ((I2C_TypeDef *)    I2C2_BASE)
#define I2C3    ((I2C_TypeDef *)    I2C3_BASE)
#define I2C4    ((I2C_TypeDef *)    I2C4_BASE)
#define I2C5    ((I2C_TypeDef *)    I2C5_BASE)
#define I2C6    ((I2C_TypeDef *)    I2C6_BASE)
#define I2C7    ((I2C_TypeDef *)    I2C7_BASE)
#define I2C8    ((I2C_TypeDef *)    I2C8_BASE)
#define I2C9    ((I2C_TypeDef *)    I2C9_BASE)
#define CAN0    ((CAN_TypeDef *)    CAN0_BASE)
#define CAN1    ((CAN_TypeDef *)    CAN1_BASE)
// usb
#define ACMP    ((ACMP_TypeDef *)   ACMP_BASE)
#define PWM0    ((PWM_TypeDef *)    PWM0_BASE)
#define QEI0    ((QEI_TypeDef *)    QEI0_BASE)
#define QEI1    ((QEI_TypeDef *)    QEI1_BASE)

#define ETH     ((ETH_TypeDef *)  ETH_BASE)

/**
 * @}
 */

#endif /* __TM4C129x_H */

/**
 * @}
 */
 
/**
 * @}
 */
